
IOSv - Cisco Systems Confidential -

Supplemental End User License Restrictions

This IOSv software is provided AS-IS without warranty of any kind. Under no circumstances may this software be used separate from the Cisco Modeling Labs Software that this software was provided with, or deployed or used as part of a production environment.

By using the software, you agree to abide by the terms and conditions of the Cisco End User License Agreement at http://www.********.com/go/eula. Unauthorized use or distribution of this software is expressly prohibited.

SW1#
SW1#terminal width 511
SW1#terminal length 0
SW1#
SW1#
SW1#
SW1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#
SW1(config)#!
SW1(config)#key chain EIGRP
SW1(config-keychain)#key 1
SW1(config-keychain-key)#key-string DBMI_EIGRP
SW1(config-keychain-key)#!
SW1(config-keychain-key)#
SW1(config-keychain-key)#    interface range po 12, po 13, gi 1/1, gi 1/0
SW1(config-if-range)#    ip authentication mode eigrp 100 md5
SW1(config-if-range)#
IOSv - Cisco Systems Confidential -

Supplemental End User License Restrictions

This IOSv software is provided AS-IS without warranty of any kind. Under no circumstances may this software be used separate from the Cisco Modeling Labs Software that this software was provided with, or deployed or used as part of a production environment.

By using the software, you agree to abide by the terms and conditions of the Cisco End User License Agreement at http://www.********.com/go/eula. Unauthorized use or distribution of this software is expressly prohibited.

SW1#
SW1#terminal width 511
SW1#terminal length 0
SW1#
SW1#
SW1#
SW1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#
SW1(config)#!
SW1(config)#key chain EIGRP
SW1(config-keychain)#key 1
SW1(config-keychain-key)#key-string DBMI_EIGRP
SW1(config-keychain-key)#!
SW1(config-keychain-key)#
SW1(config-keychain-key)#    interface range po 12, po 13, gi 1/1, gi 1/0
SW1(config-if-range)#    ip authentication mode eigrp 100 md5
SW1(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
SW1(config-if-range)#    exit
SW1(config)#    !
SW1(config)#    router eigrp 100
SW1(config-router)#    passive-interface vlan 7
SW1(config-router)#    neighbor 10.100.17.1 gi 1/1
SW1(config-router)#    !
SW1(config-router)#
SW1(config-router)#end
SW1#
SW1#
SW1#
SW1#write mem
Building configuration...
Compressed configuration from 4200 bytes to 2305 bytes[OK]
SW1#
SW1#exit

IOSv - Cisco Systems Confidential -

Supplemental End User License Restrictions

This IOSv software is provided AS-IS without warranty of any kind. Under no circumstances may this software be used separate from the Cisco Modeling Labs Software that this software was provided with, or deployed or used as part of a production environment.

By using the software, you agree to abide by the terms and conditions of the Cisco End User License Agreement at http://www.********.com/go/eula. Unauthorized use or distribution of this software is expressly prohibited.
SW1#
SW1#terminal width 511
SW1#terminal length 0
SW1#
SW1#
SW1#
SW1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#
SW1(config)#!
SW1(config)#key chain EIGRP
SW1(config-keychain)#key 1
SW1(config-keychain-key)#key-string DBMI_EIGRP
SW1(config-keychain-key)#!
SW1(config-keychain-key)#
SW1(config-keychain-key)#    interface range po 12, po 13, gi 1/1, gi 1/0
SW1(config-if-range)#    ip authentication mode eigrp 100 md5
SW1(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
SW1(config-if-range)#    exit
SW1(config)#    !
SW1(config)#    router eigrp 100
SW1(config-router)#    passive-interface vlan 7
SW1(config-router)#    neighbor 10.100.17.1 gi 1/1
SW1(config-router)#    !
SW1(config-router)#
SW1(config-router)#end
SW1#
SW1#
SW1#
SW1#write mem
Building configuration...
Compressed configuration from 4200 bytes to 2301 bytes[OK]
SW1#
SW1#exit

IOSv - Cisco Systems Confidential -

Supplemental End User License Restrictions

This IOSv software is provided AS-IS without warranty of any kind. Under no circumstances may this software be used separate from the Cisco Modeling Labs Software that this software was provided with, or deployed or used as part of a production environment.

By using the software, you agree to abide by the terms and conditions of the Cisco End User License Agreement at http://www.********.com/go/eula. Unauthorized use or distribution of this software is expressly prohibited.
SW1#
SW1#terminal width 511
SW1#terminal length 0
SW1#
SW1#
SW1#
SW1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW1(config)#
SW1(config)#!
SW1(config)#key chain EIGRP
SW1(config-keychain)#key 1
SW1(config-keychain-key)#key-string DBMI_EIGRP
SW1(config-keychain-key)#!
SW1(config-keychain-key)#
SW1(config-keychain-key)#    interface range po 12, po 13, gi 1/1, gi 1/0
SW1(config-if-range)#    ip authentication mode eigrp 100 md5
SW1(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
SW1(config-if-range)#    exit
SW1(config)#    !
SW1(config)#    router eigrp 100
SW1(config-router)#    passive-interface vlan 7
SW1(config-router)#    neighbor 10.100.17.1 gi 1/1
SW1(config-router)#    !
SW1(config-router)#
SW1(config-router)#end
SW1#
SW1#
SW1#
SW1#
SW1#write mem
Building configuration...
Compressed configuration from 4200 bytes to 2302 bytes[OK]
SW1#
SW1#exit
