
IOSv - Cisco Systems Confidential -

Supplemental End User License Restrictions

This IOSv software is provided AS-IS without warranty of any kind. Under no circumstances may this software be used separate from the Cisco Modeling Labs Software that this software was provided with, or deployed or used as part of a production environment.

By using the software, you agree to abide by the terms and conditions of the Cisco End User License Agreement at http://www.********.com/go/eula. Unauthorized use or distribution of this software is expressly prohibited.
SW3#
SW3#terminal width 511
SW3#terminal length 0
SW3#
SW3#
SW3#
SW3#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW3(config)#
SW3(config)#!
SW3(config)#key chain EIGRP
SW3(config-keychain)#key 1
SW3(config-keychain-key)#key-string DBMI_EIGRP
SW3(config-keychain-key)#!
SW3(config-keychain-key)#
SW3(config-keychain-key)#    interface range po 13, gi 0/2
SW3(config-if-range)#    ip authentication mode eigrp 100 md5
SW3(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
SW3(config-if-range)#    exit
SW3(config)#    !
SW3(config)#    router eigrp 100
SW3(config-router)#    passive-interface vlan 9
SW3(config-router)#    exit
SW3(config)#    !
SW3(config)#    interface gi 1/3
SW3(config-if)#    ip authentication mode eigrp 100 md5
SW3(config-if)#    ip authentication key-chain eigrp 100 EIGRP
SW3(config-if)#    !
SW3(config-if)#
SW3(config-if)#end
SW3#
SW3#
SW3#
SW3#write mem
Building configuration...
Compressed configuration from 3900 bytes to 2202 bytes[OK]
SW3#
SW3#exit

IOSv - Cisco Systems Confidential -

Supplemental End User License Restrictions

This IOSv software is provided AS-IS without warranty of any kind. Under no circumstances may this software be used separate from the Cisco Modeling Labs Software that this software was provided with, or deployed or used as part of a production environment.

By using the software, you agree to abide by the terms and conditions of the Cisco End User License Agreement at http://www.********.com/go/eula. Unauthorized use or distribution of this software is expressly prohibited.
SW3#
SW3#terminal width 511
SW3#terminal length 0
SW3#
SW3#
SW3#
SW3#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW3(config)#
SW3(config)#!
SW3(config)#key chain EIGRP
SW3(config-keychain)#key 1
SW3(config-keychain-key)#key-string DBMI_EIGRP
SW3(config-keychain-key)#!
SW3(config-keychain-key)#
SW3(config-keychain-key)#    interface range po 13, gi 0/2
SW3(config-if-range)#    ip authentication mode eigrp 100 md5
SW3(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
SW3(config-if-range)#    exit
SW3(config)#    !
SW3(config)#    router eigrp 100
SW3(config-router)#    passive-interface vlan 9
SW3(config-router)#    exit
SW3(config)#    !
SW3(config)#    interface gi 1/3
SW3(config-if)#    ip authentication mode eigrp 100 md5
SW3(config-if)#    ip authentication key-chain eigrp 100 EIGRP
SW3(config-if)#    !
SW3(config-if)#
SW3(config-if)#end
SW3#
SW3#
SW3#
SW3#write mem
Building configuration...
Compressed configuration from 3900 bytes to 2205 bytes[OK]
SW3#
SW3#exit

IOSv - Cisco Systems Confidential -

Supplemental End User License Restrictions

This IOSv software is provided AS-IS without warranty of any kind. Under no circumstances may this software be used separate from the Cisco Modeling Labs Software that this software was provided with, or deployed or used as part of a production environment.

By using the software, you agree to abide by the terms and conditions of the Cisco End User License Agreement at http://www.********.com/go/eula. Unauthorized use or distribution of this software is expressly prohibited.
SW3#
SW3#terminal width 511
SW3#terminal length 0
SW3#
SW3#
SW3#
SW3#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW3(config)#
SW3(config)#!
SW3(config)#key chain EIGRP
SW3(config-keychain)#key 1
SW3(config-keychain-key)#key-string DBMI_EIGRP
SW3(config-keychain-key)#!
SW3(config-keychain-key)#
SW3(config-keychain-key)#    interface range po 13, gi 0/2
SW3(config-if-range)#    ip authentication mode eigrp 100 md5
SW3(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
SW3(config-if-range)#    exit
SW3(config)#    !
SW3(config)#    router eigrp 100
SW3(config-router)#    passive-interface vlan 9
SW3(config-router)#    exit
SW3(config)#    !
SW3(config)#    interface gi 1/3
SW3(config-if)#    ip authentication mode eigrp 100 md5
SW3(config-if)#    ip authentication key-chain eigrp 100 EIGRP
SW3(config-if)#    !
SW3(config-if)#
SW3(config-if)#end
SW3#
SW3#
SW3#
SW3#write mem
Building configuration...
Compressed configuration from 3900 bytes to 2201 bytes[OK]
SW3#
SW3#exit
