


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R1#
R1#terminal width 511
R1#terminal length 0
R1#
R1#
R1#
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#
R1(config)#!
R1(config)#key chain EIGRP
R1(config-keychain)#key 1
R1(config-keychain-key)#key-string DBMI_EIGRP
R1(config-keychain-key)#!
R1(config-keychain-key)#
R1(config-keychain-key)#    interface range gi 0/0 - 1
R1(config-if-range)#    ip authentication mode eigrp 100 md5
R1(config-if-range)#


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R1#
R1#terminal width 511
R1#terminal length 0
R1#
R1#
R1#
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#
R1(config)#!
R1(config)#key chain EIGRP
R1(config-keychain)#key 1
R1(config-keychain-key)#key-string DBMI_EIGRP
R1(config-keychain-key)#!
R1(config-keychain-key)#
R1(config-keychain-key)#    interface range gi 0/0 - 1
R1(config-if-range)#    ip authentication mode eigrp 100 md5
R1(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
R1(config-if-range)#    exit
R1(config)#    !
R1(config)#
R1(config)#    router eigrp 100
R1(config-router)#     neighbor 10.100.17.7 gi 0/1
R1(config-router)#    !
R1(config-router)#
R1(config-router)#
R1(config-router)#end
R1#
R1#
R1#
R1#
R1#write mem
Building configuration...

  [OK]
R1#
R1#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R1#
R1#terminal width 511
R1#terminal length 0
R1#
R1#
R1#
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#
R1(config)#!
R1(config)#key chain EIGRP
R1(config-keychain)#key 1
R1(config-keychain-key)#key-string DBMI_EIGRP
R1(config-keychain-key)#!
R1(config-keychain-key)#
R1(config-keychain-key)#    interface range gi 0/0 - 1
R1(config-if-range)#    ip authentication mode eigrp 100 md5
R1(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
R1(config-if-range)#    exit
R1(config)#    !
R1(config)#
R1(config)#    router eigrp 100
R1(config-router)#     neighbor 10.100.17.7 gi 0/1
R1(config-router)#    !
R1(config-router)#
R1(config-router)#
R1(config-router)#end
R1#
R1#
R1#
R1#write mem
Building configuration...

  [OK]
R1#
R1#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R1#
R1#terminal width 511
R1#terminal length 0
R1#
R1#
R1#
R1#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R1(config)#
R1(config)#!
R1(config)#key chain EIGRP
R1(config-keychain)#key 1
R1(config-keychain-key)#key-string DBMI_EIGRP
R1(config-keychain-key)#!
R1(config-keychain-key)#
R1(config-keychain-key)#    interface range gi 0/0 - 1
R1(config-if-range)#    ip authentication mode eigrp 100 md5
R1(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
R1(config-if-range)#    exit
R1(config)#    !
R1(config)#
R1(config)#    router eigrp 100
R1(config-router)#     neighbor 10.100.17.7 gi 0/1
R1(config-router)#    !
R1(config-router)#
R1(config-router)#
R1(config-router)#end
R1#
R1#
R1#
R1#
R1#write mem
Building configuration...

  [OK]
R1#
R1#exit
