
IOSv - Cisco Systems Confidential -

Supplemental End User License Restrictions

This IOSv software is provided AS-IS without warranty of any kind. Under no circumstances may this software be used separate from the Cisco Modeling Labs Software that this software was provided with, or deployed or used as part of a production environment.

By using the software, you agree to abide by the terms and conditions of the Cisco End User License Agreement at http://www.********.com/go/eula. Unauthorized use or distribution of this software is expressly prohibited.
SW2#
SW2#terminal width 511
SW2#terminal length 0
SW2#
SW2#
SW2#
SW2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#
SW2(config)#!
SW2(config)#key chain EIGRP
SW2(config-keychain)#key 1
SW2(config-keychain-key)#key-string DBMI_EIGRP
SW2(config-keychain-key)#!
SW2(config-keychain-key)#
SW2(config-keychain-key)#    interface range po 12, po 24, gi 1/1, gi 1/0
SW2(config-if-range)#    ip authentication mode eigrp 100 md5
SW2(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
SW2(config-if-range)#    exit
SW2(config)#    !
SW2(config)#    router eigrp 100
SW2(config-router)#    passive-interface vlan 8
SW2(config-router)#    neighbor 10.100.48.4 gi 1/1
SW2(config-router)#    !
SW2(config-router)#
SW2(config-router)#end
SW2#
SW2#
SW2#
SW2#write mem
Building configuration...
Compressed configuration from 4210 bytes to 2316 bytes[OK]
SW2#
SW2#exit

IOSv - Cisco Systems Confidential -

Supplemental End User License Restrictions

This IOSv software is provided AS-IS without warranty of any kind. Under no circumstances may this software be used separate from the Cisco Modeling Labs Software that this software was provided with, or deployed or used as part of a production environment.

By using the software, you agree to abide by the terms and conditions of the Cisco End User License Agreement at http://www.********.com/go/eula. Unauthorized use or distribution of this software is expressly prohibited.
SW2#
SW2#terminal width 511
SW2#terminal length 0
SW2#
SW2#
SW2#
SW2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#
SW2(config)#!
SW2(config)#key chain EIGRP
SW2(config-keychain)#key 1
SW2(config-keychain-key)#key-string DBMI_EIGRP
SW2(config-keychain-key)#!
SW2(config-keychain-key)#
SW2(config-keychain-key)#    interface range po 12, po 24, gi 1/1, gi 1/0
SW2(config-if-range)#    ip authentication mode eigrp 100 md5
SW2(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
SW2(config-if-range)#    exit
SW2(config)#    !
SW2(config)#    router eigrp 100
SW2(config-router)#    passive-interface vlan 8
SW2(config-router)#    neighbor 10.100.48.4 gi 1/1
SW2(config-router)#    !
SW2(config-router)#
SW2(config-router)#end
SW2#
SW2#
SW2#
SW2#write mem
Building configuration...
Compressed configuration from 4210 bytes to 2323 bytes[OK]
SW2#
SW2#exit

IOSv - Cisco Systems Confidential -

Supplemental End User License Restrictions

This IOSv software is provided AS-IS without warranty of any kind. Under no circumstances may this software be used separate from the Cisco Modeling Labs Software that this software was provided with, or deployed or used as part of a production environment.

By using the software, you agree to abide by the terms and conditions of the Cisco End User License Agreement at http://www.********.com/go/eula. Unauthorized use or distribution of this software is expressly prohibited.
SW2#
SW2#terminal width 511
SW2#terminal length 0
SW2#
SW2#
SW2#
SW2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#
SW2(config)#!
SW2(config)#key chain EIGRP
SW2(config-keychain)#key 1
SW2(config-keychain-key)#key-string DBMI_EIGRP
SW2(config-keychain-key)#!
SW2(config-keychain-key)#
SW2(config-keychain-key)#    interface range po 12, po 24, gi 1/1, gi 0/3
SW2(config-if-range)#    ip authentication mode eigrp 100 md5
SW2(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
SW2(config-if-range)#    exit
SW2(config)#    !
SW2(config)#    router eigrp 100
SW2(config-router)#    passive-interface vlan 8
SW2(config-router)#    neighbor 10.100.48.4 gi 1/1
SW2(config-router)#    !
SW2(config-router)#
SW2(config-router)#end
SW2#
SW2#
SW2#
SW2#write mem
Building configuration...
Compressed configuration from 4210 bytes to 2312 bytes[OK]
SW2#
SW2#exit

IOSv - Cisco Systems Confidential -

Supplemental End User License Restrictions

This IOSv software is provided AS-IS without warranty of any kind. Under no circumstances may this software be used separate from the Cisco Modeling Labs Software that this software was provided with, or deployed or used as part of a production environment.

By using the software, you agree to abide by the terms and conditions of the Cisco End User License Agreement at http://www.********.com/go/eula. Unauthorized use or distribution of this software is expressly prohibited.
SW2#
SW2#terminal width 511
SW2#terminal length 0
SW2#
SW2#
SW2#
SW2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
SW2(config)#
SW2(config)#!
SW2(config)#key chain EIGRP
SW2(config-keychain)#key 1
SW2(config-keychain-key)#key-string DBMI_EIGRP
SW2(config-keychain-key)#!
SW2(config-keychain-key)#
SW2(config-keychain-key)#    interface range po 12, po 24, gi 1/1, gi 0/3
SW2(config-if-range)#    ip authentication mode eigrp 100 md5
SW2(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
SW2(config-if-range)#    exit
SW2(config)#    !
SW2(config)#    router eigrp 100
SW2(config-router)#    passive-interface vlan 8
SW2(config-router)#    neighbor 10.100.48.4 gi 1/1
SW2(config-router)#    !
SW2(config-router)#
SW2(config-router)#end
SW2#
SW2#
SW2#
SW2#write mem
Building configuration...
Compressed configuration from 4210 bytes to 2319 bytes[OK]
SW2#
SW2#exit
