

**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R4#
R4#terminal width 511
R4#terminal length 0
R4#
R4#
R4#
R4#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#
R4(config)#!
R4(config)#key chain EIGRP
R4(config-keychain)#key 1
R4(config-keychain-key)#key-string DBMI_EIGRP
R4(config-keychain-key)#!
R4(config-keychain-key)#
R4(config-keychain-key)#    interface range gi 0/0 - gi 0/1
                                                     ^
% Invalid input detected at '^' marker.

R4(config)#    ip authentication mode eigrp 100 md5
                      ^
% Invalid input detected at '^' marker.

R4(config)#    ip authentication key-chain eigrp 100 EIGRP
                      ^
% Invalid input detected at '^' marker.

R4(config)#    !
R4(config)#
R4(config)#    router eigrp 100
R4(config-router)#     neighbor 10.100.48.8 gi 0/1
R4(config-router)#
R4(config-router)#
R4(config-router)#end
R4#
R4#
R4#
R4#write mem
Building configuration...

  [OK]
R4#
R4#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R4#
R4#terminal width 511
R4#terminal length 0
R4#
R4#
R4#
R4#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#
R4(config)#!
R4(config)#key chain EIGRP
R4(config-keychain)#key 1
R4(config-keychain-key)#key-string DBMI_EIGRP
R4(config-keychain-key)#exit
R4(config-keychain)#!
R4(config-keychain)#
R4(config-keychain)#    interface range gi 0/0 - gi 0/1
                                                 ^
% Invalid input detected at '^' marker.

R4(config)#    ip authentication mode eigrp 100 md5
                      ^
% Invalid input detected at '^' marker.

R4(config)#    ip authentication key-chain eigrp 100 EIGRP
                      ^
% Invalid input detected at '^' marker.

R4(config)#    !
R4(config)#
R4(config)#    router eigrp 100
R4(config-router)#     neighbor 10.100.48.8 gi 0/1
R4(config-router)#
R4(config-router)#
R4(config-router)#end
R4#
R4#
R4#
R4#write mem
Building configuration...

  [OK]
R4#
R4#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R4#
R4#terminal width 511
R4#terminal length 0
R4#
R4#
R4#
R4#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#
R4(config)#!
R4(config)#key chain EIGRP
R4(config-keychain)#key 1
R4(config-keychain-key)#key-string DBMI_EIGRP
R4(config-keychain-key)#exit
R4(config-keychain)#exit
R4(config)#!
R4(config)#
R4(config)#    interface range gi 0/0 - gi 0/1
                                        ^
% Invalid input detected at '^' marker.

R4(config)#    ip authentication mode eigrp 100 md5
                      ^
% Invalid input detected at '^' marker.

R4(config)#    ip authentication key-chain eigrp 100 EIGRP
                      ^
% Invalid input detected at '^' marker.

R4(config)#    !
R4(config)#
R4(config)#    router eigrp 100
R4(config-router)#     neighbor 10.100.48.8 gi 0/1
R4(config-router)#
R4(config-router)#
R4(config-router)#end
R4#
R4#
R4#
R4#write mem
Building configuration...

  [OK]
R4#
R4#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R4#
R4#terminal width 511
R4#terminal length 0
R4#
R4#
R4#
R4#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#
R4(config)#!
R4(config)#key chain EIGRP
R4(config-keychain)#key 1
R4(config-keychain-key)#key-string DBMI_EIGRP
R4(config-keychain-key)#!
R4(config-keychain-key)#
R4(config-keychain-key)#    interface range gi 0/0 - gi 0/1
                                                     ^
% Invalid input detected at '^' marker.

R4(config)#    ip authentication mode eigrp 100 md5
                      ^
% Invalid input detected at '^' marker.

R4(config)#    ip authentication key-chain eigrp 100 EIGRP
                      ^
% Invalid input detected at '^' marker.

R4(config)#    !
R4(config)#
R4(config)#    router eigrp 100
R4(config-router)#     neighbor 10.100.48.8 gi 0/1
R4(config-router)#
R4(config-router)#
R4(config-router)#end
R4#
R4#
R4#
R4#write mem
Building configuration...

  [OK]
R4#
R4#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R4#
R4#terminal width 511
R4#terminal length 0
R4#
R4#
R4#
R4#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#
R4(config)#!
R4(config)#key chain EIGRP
R4(config-keychain)#key 1
R4(config-keychain-key)#key-string DBMI_EIGRP
R4(config-keychain-key)#!
R4(config-keychain-key)#
R4(config-keychain-key)#    interface range gi 0/0 - 1
R4(config-if-range)#    ip authentication mode eigrp 100 md5
R4(config-if-range)#


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R4#
R4#terminal width 511
R4#terminal length 0
R4#
R4#
R4#
R4#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#
R4(config)#!
R4(config)#key chain EIGRP
R4(config-keychain)#key 1
R4(config-keychain-key)#key-string DBMI_EIGRP
R4(config-keychain-key)#!
R4(config-keychain-key)#
R4(config-keychain-key)#    interface range gi 0/0 - 1
R4(config-if-range)#    ip authentication mode eigrp 100 md5
R4(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
R4(config-if-range)#    exit
R4(config)#    !
R4(config)#
R4(config)#    router eigrp 100
R4(config-router)#     neighbor 10.100.48.8 gi 0/1
R4(config-router)#
R4(config-router)#
R4(config-router)#end
R4#
R4#
R4#
R4#write mem
Building configuration...

  [OK]
R4#
R4#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R4#
R4#terminal width 511
R4#terminal length 0
R4#
R4#
R4#
R4#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#
R4(config)#!
R4(config)#key chain EIGRP
R4(config-keychain)#key 1
R4(config-keychain-key)#key-string DBMI_EIGRP
R4(config-keychain-key)#!
R4(config-keychain-key)#
R4(config-keychain-key)#    interface range gi 0/0 - 1
R4(config-if-range)#    ip authentication mode eigrp 100 md5
R4(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
R4(config-if-range)#    exit
R4(config)#    !
R4(config)#
R4(config)#    router eigrp 100
R4(config-router)#     neighbor 10.100.48.8 gi 0/1
R4(config-router)#
R4(config-router)#
R4(config-router)#end
R4#
R4#
R4#
R4#write mem
Building configuration...

  [OK]
R4#
R4#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R4#
R4#terminal width 511
R4#terminal length 0
R4#
R4#
R4#
R4#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#
R4(config)#!
R4(config)#key chain EIGRP
R4(config-keychain)#key 1
R4(config-keychain-key)#key-string DBMI_EIGRP
R4(config-keychain-key)#!
R4(config-keychain-key)#
R4(config-keychain-key)#    interface range gi 0/0 - 1
R4(config-if-range)#    ip authentication mode eigrp 100 md5
R4(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
R4(config-if-range)#    exit
R4(config)#    !
R4(config)#
R4(config)#    router eigrp 100
R4(config-router)#     neighbor 10.100.48.8 gi 0/1
R4(config-router)#
R4(config-router)#
R4(config-router)#end
R4#
R4#
R4#
R4#write mem
Building configuration...

  [OK]
R4#
R4#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R4#
R4#terminal width 511
R4#terminal length 0
R4#
R4#
R4#
R4#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#
R4(config)#!
R4(config)#key chain EIGRP
R4(config-keychain)#key 1
R4(config-keychain-key)#key-string DBMI_EIGRP
R4(config-keychain-key)#!
R4(config-keychain-key)#
R4(config-keychain-key)#    interface range gi 0/0 - 1
R4(config-if-range)#    ip authentication mode eigrp 100 md5
R4(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
R4(config-if-range)#    exit
R4(config)#    !
R4(config)#
R4(config)#    router eigrp 100
R4(config-router)#     neighbor 10.100.48.8 gi 0/1
R4(config-router)#
R4(config-router)#
R4(config-router)#end
R4#
R4#
R4#
R4#
R4#write mem
Building configuration...

  [OK]
R4#
R4#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R4#
R4#terminal width 511
R4#terminal length 0
R4#
R4#
R4#
R4#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R4(config)#
R4(config)#!
R4(config)#key chain EIGRP
R4(config-keychain)#key 1
R4(config-keychain-key)#key-string DBMI_EIGRP
R4(config-keychain-key)#!
R4(config-keychain-key)#
R4(config-keychain-key)#    interface range gi 0/0 - 1
R4(config-if-range)#    ip authentication mode eigrp 100 md5
R4(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
R4(config-if-range)#    exit
R4(config)#    !
R4(config)#
R4(config)#    router eigrp 100
R4(config-router)#     neighbor 10.100.48.8 gi 0/1
R4(config-router)#
R4(config-router)#
R4(config-router)#end
R4#
R4#
R4#
R4#write mem
Building configuration...

  [OK]
R4#
R4#exit
