

**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R2#
R2#terminal width 511
R2#terminal length 0
R2#
R2#
R2#
R2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#
R2(config)#!
R2(config)#key chain EIGRP
R2(config-keychain)#key 1
R2(config-keychain-key)#key-string DBMI_EIGRP
R2(config-keychain-key)#!
R2(config-keychain-key)#
R2(config-keychain-key)#    interface range gi 0/1 - 2
R2(config-if-range)#    ip authentication mode eigrp 100 md5
R2(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
R2(config-if-range)#    exit
R2(config)#    !
R2(config)#    router eigrp 100
R2(config-router)#    passive-interface default
R2(config-router)#    !
R2(config-router)#    no passive-interface gi 0/1
R2(config-router)#    no passive-interface gi 0/2
R2(config-router)#    !
R2(config-router)#
R2(config-router)#end
R2#
R2#
R2#
R2#
R2#write mem
Building configuration...

  [OK]
R2#
R2#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R2#
R2#terminal width 511
R2#terminal length 0
R2#
R2#
R2#
R2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#
R2(config)#!
R2(config)#key chain EIGRP
R2(config-keychain)#key 1
R2(config-keychain-key)#key-string DBMI_EIGRP
R2(config-keychain-key)#!
R2(config-keychain-key)#
R2(config-keychain-key)#    interface range gi 0/1 - 2
R2(config-if-range)#    ip authentication mode eigrp 100 md5
R2(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
R2(config-if-range)#    exit
R2(config)#    !
R2(config)#    router eigrp 100
R2(config-router)#    passive-interface default
R2(config-router)#    !
R2(config-router)#    no passive-interface gi 0/1
R2(config-router)#    no passive-interface gi 0/2
R2(config-router)#    !
R2(config-router)#
R2(config-router)#end
R2#
R2#
R2#
R2#write mem
Building configuration...

  [OK]
R2#
R2#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R2#
R2#terminal width 511
R2#terminal length 0
R2#
R2#
R2#
R2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#
R2(config)#!
R2(config)#key chain EIGRP
R2(config-keychain)#key 1
R2(config-keychain-key)#key-string DBMI_EIGRP
R2(config-keychain-key)#!
R2(config-keychain-key)#
R2(config-keychain-key)#    interface range gi 0/1 - 2
R2(config-if-range)#    ip authentication mode eigrp 100 md5
R2(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
R2(config-if-range)#    exit
R2(config)#    !
R2(config)#    router eigrp 100
R2(config-router)#    passive-interface default
R2(config-router)#    !
R2(config-router)#    no passive-interface gi 0/1
R2(config-router)#    no passive-interface gi 0/2
R2(config-router)#    !
R2(config-router)#
R2(config-router)#end
R2#
R2#
R2#
R2#write mem
Building configuration...

  [OK]
R2#
R2#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R2#
R2#terminal width 511
R2#terminal length 0
R2#
R2#
R2#
R2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#
R2(config)#!
R2(config)#key chain EIGRP
R2(config-keychain)#key 1
R2(config-keychain-key)#key-string DBMI_EIGRP
R2(config-keychain-key)#!
R2(config-keychain-key)#
R2(config-keychain-key)#    interface range gi 0/1 - 2
R2(config-if-range)#    ip authentication mode eigrp 100 md5
R2(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
R2(config-if-range)#    exit
R2(config)#    !
R2(config)#    router eigrp 100
R2(config-router)#    passive-interface default
R2(config-router)#    !
R2(config-router)#    no passive-interface gi 0/1
R2(config-router)#    no passive-interface gi 0/2
R2(config-router)#    !
R2(config-router)#
R2(config-router)#end
R2#
R2#
R2#
R2#write mem
Building configuration...

  [OK]
R2#
R2#exit


**************************************************************************
* IOSv is strictly limited to use for evaluation, demonstration and IOS  *
* education. IOSv is provided as-is and is not supported by Cisco's      *
* Technical Advisory Center. Any use or disclosure, in whole or in part, *
* of the IOSv Software or Documentation to any third party for any       *
* purposes is expressly prohibited except as otherwise authorized by     *
* Cisco in writing.                                                      *
**************************************************************************
R2#
R2#terminal width 511
R2#terminal length 0
R2#
R2#
R2#
R2#configure terminal
Enter configuration commands, one per line.  End with CNTL/Z.
R2(config)#
R2(config)#!
R2(config)#key chain EIGRP
R2(config-keychain)#key 1
R2(config-keychain-key)#key-string DBMI_EIGRP
R2(config-keychain-key)#!
R2(config-keychain-key)#
R2(config-keychain-key)#    interface range gi 0/1 - 2
R2(config-if-range)#    ip authentication mode eigrp 100 md5
R2(config-if-range)#    ip authentication key-chain eigrp 100 EIGRP
R2(config-if-range)#    exit
R2(config)#    !
R2(config)#    router eigrp 100
R2(config-router)#    passive-interface default
R2(config-router)#    !
R2(config-router)#    no passive-interface gi 0/1
R2(config-router)#    no passive-interface gi 0/2
R2(config-router)#    !
R2(config-router)#
R2(config-router)#end
R2#
R2#
R2#
R2#write mem
Building configuration...

  [OK]
R2#
R2#exit
